---
type: FacetingUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# FacetingUtils

`Autodesk.Revit.DB.FacetingUtils` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ConvertTrianglesToQuads | 2013 | `public static IList < TriOrQuadFacet > ConvertTrianglesToQuads ( TriangulationInterface triangulation )` |